artillery.yml
config:
  target: 'http://localhost:3306'
  phases:
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 30
      arrivalRate: 100
      name: "Sustained max load"

scenarios:
  - flow:
    # - loop:
    #   - get:
    #       url: "/cruddy/{{$randomNumber(1, 10000000)}}"
    # count: 100
    - loop:
      - get:
          url: "/cruddy/{{$randomNumber(1, 10000000)}}"
    count: 1